{"id":152,"date":"2009-06-01T16:46:57","date_gmt":"2009-06-01T16:46:57","guid":{"rendered":"http:\/\/sbullock.net\/?page_id=152"},"modified":"2020-05-10T14:18:53","modified_gmt":"2020-05-10T13:18:53","slug":"sandra","status":"publish","type":"page","link":"https:\/\/sandra-bullock.net\/sandra\/","title":{"rendered":"Sandra"},"content":{"rendered":"<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\" width=\"100%\">\n<tbody>\n<tr>\n<td valign=\"top\" width=\"50%\">\n<strong>Birth name:<\/strong> Sandra Annette Bullock<br \/>\n<strong>Birth place:<\/strong> Arlington County, Virginia<br \/>\n<strong>Date of Birth:<\/strong> July 26, 1964<br \/>\n<strong>Height<\/strong>: 5&#8242; 7&#8243; (1.71 m)<br \/>\n<strong>Zodiac Sign:<\/strong> Leo<br \/>\n<strong>Kids:<\/strong> Louis &#038; Laila<\/p>\n<p><strong>Fanmail Adress:<\/strong><br \/>\nSandra Bullock<br \/>\nc\/o Creative Artists Agency<br \/>\n9830 Wilshire Blvd.<br \/>\nBeverly Hills, CA 90212<br \/>\nUSA\n<\/p>\n<\/td>\n<td valign=\"top\" width=\"35%\">\n&nbsp;&nbsp;&nbsp;&nbsp;001. <a href=\"#Biography\">Biography<\/a><br \/>\n&nbsp;&nbsp;&nbsp;&nbsp;002. <a href=\"\/sandra\/quotes\/\">Quotes<\/a><br \/>\n&nbsp;&nbsp;&nbsp;&nbsp;003. <a href=\"\/sandra\/facts\/\">Facts<\/a><br \/>\n&nbsp;&nbsp;&nbsp;&nbsp;004. <a href=\"\/sandra\/astrology\/\">Astrology<\/a><br \/>\n&nbsp;&nbsp;&nbsp;&nbsp;005. <a href=\"\/sandra\/awars\/\">Awards &#038; Nominations<\/a>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<h1><a name=\"Biography\"><\/a>Biography<\/h1>\n<p>Sandra Annette Bullock is an American actress. She came to fame in the 1990s, after roles in successful films such as Speed and While You Were Sleeping. She has since established her career as a well-known leading Hollywood actress, with films such as Miss Congeniality and 2005&#8217;s Crash, which received critical acclaim. In 2007 she was ranked as the 14th richest female celebrity with an estimated fortune of $85 million.<\/p>\n<h1>Early life<\/h1>\n<p><img decoding=\"async\" src=\"\/graphics\/info\/bio-02.jpg\" class=\"alignleft\">Bullock was born in Arlington County, Virginia, the daughter of Helga D. Meyer, a German opera singer and part-time vocal coach, and John W. Bullock, a Pentagon contractor and executive from Alabama. Bullock&#8217;s maternal grandfather was a rocket scientist from Nuremberg, Germany. On her father&#8217;s side, she is descended from a prominent family in early Alabama history for whom Bullock County is named. Bullock lived in Nuremberg until age twelve, where she sang in the opera&#8217;s children&#8217;s choir at the Staatstheater Nürnberg. She frequently traveled with her mother on her opera tours, and lived in Germany and other parts of Europe for much of her childhood. She is fluent in German and holds German citizenship via her late mother&#8217;s nationality. Bullock studied ballet and vocal arts as a child, taking small parts in her mother&#8217;s opera productions.<\/p>\n<p>Bullock attended Washington-Lee High School where she was a cheerleader, participated in high school theater productions and dated a football player. She graduated in 1982 and enrolled in East Carolina University in Greenville, North Carolina. During this time, she worked as a waitress at a restaurant. She later left school during her senior year (Spring 1986), only three credits short of graduating, to pursue an acting career. She went on to Manhattan to pursue auditions and supported herself with a variety of odd jobs (bartender, cocktail waitress, coat checker).<\/p>\n<p>Bullock later completed her coursework and was awarded a bachelor&#8217;s degree from East Carolina University.<\/p>\n<h1>Career<\/h1>\n<p><img decoding=\"async\" src=\"\/graphics\/info\/bio-03.jpg\" class=\"alignleft\">While in New York, Bullock took acting classes at the Neighborhood Playhouse. She appeared in several student films and later landed a role in an Off-Broadway play No Time Flat. Director Alan J. Levi was impressed by Bullock&#8217;s performance and offered her a part in the made-for-TV movie Bionic Showdown: The Six Million Dollar Man and the Bionic Woman (1989). After filming the TV movie, Bullock stayed in Los Angeles and was cast in a series of small roles in several independent films as well as in the lead role of the short-lived NBC television version of the film Working Girl (1990). She later appeared in several films such as Love Potion No. 9 (1992), The Thing Called Love (1993) and Fire on the Amazon (where she agreed to appear topless if the camera did not show that much, she covered herself with duct tape which apparently was somewhat painful to take off).<\/p>\n<p>One of Bullock&#8217;s first notable movie appearances was in the science-fiction\/action movie Demolition Man (1993), which starred Sylvester Stallone and Wesley Snipes. This role then led to her break-through performance in Speed the following year. She became a high-level movie star in the late 1990s, carrying a string of successes, including While You Were Sleeping (replacing actress Demi Moore, who was originally scheduled to star), and Miss Congeniality. Bullock received $11 million dollars for Speed 2: Cruise Control and $17.5 million dollars for Miss Congeniality 2: Armed &#038; Fabulous.<\/p>\n<p>Bullock was selected as one of People magazine&#8217;s 50 Most Beautiful People in the World in 1996 and 1999, and was also ranked #58 in Empire magazine&#8217;s Top 100 Movie Stars of All Time list. She was presented with the 2002 Raúl Juliá Award for Excellence for her efforts, as the executive producer of the sitcom The George Lopez Show, in helping expand career openings for Hispanic talent in the media and entertainment industry. She also made several appearances on the show as Accident Amy, an accident-prone employee at the factory Lopez&#8217;s character manages. In 2002, she starred opposite Hugh Grant in the global hit Two Weeks Notice.<\/p>\n<p>In 2005, Bullock had a supporting role in the film Crash. She received positive reviews for her performance, with some critics suggesting that it was the best performance of her career. Bullock later appeared in The Lake House, a romantic drama also starring her Speed co-star, Keanu Reeves; it was released on June 16, 2006. Because their film characters are separated throughout the film (due to the plot revolving around time travel), Bullock and Reeves were only on set together for two weeks during filming. The same year, Bullock appeared in Infamous, playing author Harper Lee. Bullock also stars in Premonition with Julian McMahon, which was released in March 2007.<\/p>\n<h1>Entrepreneurship<\/h1>\n<p>Bullock runs her own production company, Fortis Films. Her sister, Gesine Bullock-Prado, is president of the company and her father, John Bullock, is its CEO. She was an executive producer of The George Lopez Show which garnered a lucrative syndication deal that banked Bullock some $10 million (co-produced with Robert Borden). Bullock tried to produce a film based on F.X. Toole&#8217;s short story, Million-Dollar Baby, but could not interest the studios in a female boxing drama. The story was eventually adapted and directed by Clint Eastwood as the Oscar-winning film, Million Dollar Baby (2004). Bullock&#8217;s production company, Fortis Films, will produce her next movie, All About Steve. In the meantime, she tends to her Austin restaurant, Bess Bistro,and it&#8217;s first merchandising tie-in, a line of Bessence organic candles.<\/p>\n<h1>Personal Life<\/h1>\n<p>Bullock was once engaged to actor Tate Donovan whom she met while filming Love Potion No. 9. Their relationship lasted four years. She previously dated football player Troy Aikman, Austin musician Bob Schneider (for two years) and actors Matthew McConaughey and Ryan Gosling.<\/p>\n<p>Bullock married motorcycle builder and Monster Garage host Jesse James on July 16, 2005. They met when Bullock arranged for her ten-year-old godson to meet James as a Christmas present. On her husband and her marriage, Bullock has commented:<\/p>\n<p><img decoding=\"async\" src=\"\/graphics\/info\/bio-04.jpg\" class=\"alignleft\" height=\"150\"><\/p>\n<blockquote><p>So basically through a courtship of letters &#8230; I learned about a human being. It was not something I wanted, needed, or looked for, but because he was a stronger person than I was, spiritually and on a tolerance level, I was lucky enough that he educated me&#8230; I always thought of marriage as a death sentence, that there&#8217;d be a ball and chain, and you&#8217;d be told, &#8220;You need to stop doing these things and become a good little wife.&#8221; Now people say &#8220;Oh my God you&#8217;re going to have sex with one person the rest of your life!&#8221; I hope I have sex with him for the rest of my life &#8211; because I like it!<\/p><\/blockquote>\n<p>Bullock has twice donated $1 million to the American Red Cross, first to its Liberty Disaster Relief Fund and four years later in response to the 2004 Indian Ocean earthquake and tsunamis.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Birth name: Sandra Annette Bullock Birth place: Arlington County, Virginia Date of Birth: July 26, 1964 Height: 5&#8242; 7&#8243; (1.71 m) Zodiac Sign: Leo Kids: Louis &#038; Laila Fanmail Adress: Sandra Bullock c\/o Creative Artists Agency 9830 Wilshire Blvd. Beverly Hills, CA 90212 USA &nbsp;&nbsp;&nbsp;&nbsp;001. Biography &nbsp;&nbsp;&nbsp;&nbsp;002. Quotes &nbsp;&nbsp;&nbsp;&nbsp;003. Facts &nbsp;&nbsp;&nbsp;&nbsp;004. Astrology &nbsp;&nbsp;&nbsp;&nbsp;005. Awards &#038; &hellip; <a href=\"https:\/\/sandra-bullock.net\/sandra\/\" class=\"more-link\">Continue reading<\/a><\/p>\n","protected":false},"author":13,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"open","template":"","meta":{"footnotes":""},"class_list":["post-152","page","type-page","status-publish","hentry"],"_links":{"self":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/pages\/152","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/comments?post=152"}],"version-history":[{"count":0,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/pages\/152\/revisions"}],"wp:attachment":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/media?parent=152"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}