{"id":321,"date":"2009-11-30T18:28:17","date_gmt":"2009-11-30T18:28:17","guid":{"rendered":"http:\/\/sbullock.net\/?page_id=321"},"modified":"2020-05-10T14:18:54","modified_gmt":"2020-05-10T13:18:54","slug":"disclaimer","status":"publish","type":"page","link":"https:\/\/sandra-bullock.net\/website\/disclaimer\/","title":{"rendered":"Disclaimer"},"content":{"rendered":"<p>&bull; Adoring Sandra is an <strong>unofficial<\/strong> fan site dedicated to actress Sandra Bullock. Our purpose is to promote interest in this actress and her activities.<\/p>\n<p>&bull; We are in no way officially affiliated with Sandra and her representation. This is a site made by a fan for the fans. This is a non-profit website and all materials on this site are for entertainment purposes only.<\/p>\n<p>&bull; All graphics and original content are property of Adoring Sandra, unless stated otherwise.<\/p>\n<p>&bull; <strong>No copyright infringement is ever intended<\/strong>. Picture copyright is owned by the respective photographers. If you want to see pictures on this website removed, please specify which ones and give us time to remove these before taking any further action. If you are a copyright holder and wish credits on your images or articles, please let me know and I will be glad to add them.<\/p>\n<h1>Terms of Use<\/H1><\/p>\n<p>By visiting this site, you are bound by these terms:<\/p>\n<p>In the terms below, WEBMASTER refers to the owner(s) and\/or maintainer(s) of this entire web site.<\/p>\n<blockquote><p>&bull;  You agree not to threaten, harass, take legal action against, coerse, make demands or requests of, or force signatures or other legal contracts with the WEBMASTER no matter what the reason, even if you feel you have legal right.<\/p>\n<p>&bull;  You agree not to hold the WEBMASTER liable for anything you find on this site.<\/p>\n<p>&bull;  You agree not to redistribute any portion of this site.<\/p>\n<p>&bull;  Unless specified otherwise, the WEBMASTER does not claim ownership to anything found on this site.<\/p>\n<p>&bull;  The WEBMASTER does not knowingly intend or attempt to offend or violate any copyright or intellectual property rights of any entity.<\/p>\n<p>&bull;  To the best of the WEBMASTER&#8217;s knowledge, all content, images, videos, sounds, photos, etc., if any, are being used in compliance with Fair Use Copyright Law 107.<\/p>\n<p>&bull;  The WEBMASTER does not claim any affiliation or connection with the celebrities or any other entity referenced on this site.<\/p>\n<p>&bull;  This is a fan-operated site and the WEBMASTER is not compensated for any portion of this site in any way.<\/p>\n<p>&bull;  This site may contain material inappropriate for some viewers.<\/p>\n<p>&bull;  The WEBMASTER reserves the right to make changes to any part of this site at any time.<\/p>\n<p>&bull;  These terms are in effect throughout the entire site and includes all content  <\/p><\/blockquote>\n","protected":false},"excerpt":{"rendered":"<p>&bull; Adoring Sandra is an unofficial fan site dedicated to actress Sandra Bullock. Our purpose is to promote interest in this actress and her activities. &bull; We are in no way officially affiliated with Sandra and her representation. This is a site made by a fan for the fans. This is a non-profit website and &hellip; <a href=\"https:\/\/sandra-bullock.net\/website\/disclaimer\/\" class=\"more-link\">Continue reading<\/a><\/p>\n","protected":false},"author":13,"featured_media":0,"parent":90,"menu_order":0,"comment_status":"closed","ping_status":"open","template":"","meta":{"footnotes":""},"class_list":["post-321","page","type-page","status-publish","hentry"],"_links":{"self":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/pages\/321","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/comments?post=321"}],"version-history":[{"count":0,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/pages\/321\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/pages\/90"}],"wp:attachment":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/media?parent=321"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}