{"id":354,"date":"2009-12-03T02:48:48","date_gmt":"2009-12-03T02:48:48","guid":{"rendered":"http:\/\/sbullock.net\/?page_id=354"},"modified":"2020-05-10T14:18:54","modified_gmt":"2020-05-10T13:18:54","slug":"quotes","status":"publish","type":"page","link":"https:\/\/sandra-bullock.net\/sandra\/quotes\/","title":{"rendered":"Quotes"},"content":{"rendered":"<div class=\"facts\">Miss Congeniality is the furthest thing from me. I relate to the woman in Crash – not the bigotry but the rage. That came easily. My brother-in-law says Premonition is close to the real me. But how can we ever know? I know who I am.<\/div>\n<div class=\"facts\">My mother looked like a combination of Jackie O and Maria Callas. She always said ‘Be original.’ I understand that now more than ever.<\/div>\n<div class=\"facts\">(On opening a restaurant in Austin) It’s the male side of me. I do have one. It used to fight with the female, and now they don’t fight anymore.<\/div>\n<div class=\"facts\">Everything happened when it was supposed to – and everything happened when I was ready for it.<\/div>\n<div class=\"facts\">I&#8217;ve learned that success comes in a very prickly package. Whether you choose to accept it or not is up to you. It&#8217;s what you choose to do with it, the people you choose to surround yourself with. Always choose people that are better than you. Always choose people that challenge you and are smarter than you. Always be the student. Once you find yourself to be the teacher, you&#8217;ve lost it.<\/div>\n<div class=\"facts\">I have an expensive hobby, buying homes, redoing them, tearing them down and building them up the way they want to be built. I think I would go back to school to be an architect.<\/div>\n<div class=\"facts\">I think that&#8217;s the problem with sequels. You sort of want to stay true to the first one and when you do it you sometimes go too much back to the first one and just repeat what you did before. If you go too far from the first one you lose what it was.<\/div>\n<div class=\"facts\">I don&#8217;t know if I always want to be in front of the camera. I love producing, I love the camaraderie. I love the adventures. I love the stress. It&#8217;s sort of an investment with the next step of my career; where I want to do. I love watching people be creative, and being amazing and putting those people together. Fun stories. It is the other part of my life which I&#8217;m moving more towards. Less desire to be in front of the cameras. So it&#8217;s both.<\/div>\n<div class=\"facts\">(about murder and violent crimes) It’s been going on for thousands of years, but until we’ve had the media we haven’t been able to bring it to the public eye. Lately it seems like there’s an influx of these events. Maybe there is. Maybe there isn’t, but it’s something that does need to be addressed now because we need to look at our society. And we need to look at our home life. What is it that’s making these people so young, so unhappy, so angry and so capable of doing something like this. You know, I think unless you address it, it’s not going to be solved.<\/div>\n<div class=\"facts\">When I come to meet the press to publicise my films, I get free food, so that&#8217;s a day when I saved some money, which has to be a good thing!<\/div>\n<div class=\"facts\">I can remember the first and last names of every single person that terrorized me in junior high. It taught me to be incredibly kind to people.<\/div>\n<div class=\"facts\">I can install toilets. I know all about the wax ring. I can tile floors. I&#8217;m learning how to do basic wiring.<\/div>\n<div class=\"facts\">I didn&#8217;t know Bacardi should be mixed with anything so I just drank it straight. My mom took me to hospital because she thought I&#8217;d taken drugs.<\/div>\n<div class=\"facts\">He (her husband) dresses me. I said I want a jumpsuit and he’s got a clothing company and he made me a jumpsuit. On her husband designing some of her clothing.<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Miss Congeniality is the furthest thing from me. I relate to the woman in Crash – not the bigotry but the rage. That came easily. My brother-in-law says Premonition is close to the real me. But how can we ever know? I know who I am. My mother looked like a combination of Jackie O &hellip; <a href=\"https:\/\/sandra-bullock.net\/sandra\/quotes\/\" class=\"more-link\">Continue reading<\/a><\/p>\n","protected":false},"author":13,"featured_media":0,"parent":152,"menu_order":0,"comment_status":"closed","ping_status":"open","template":"","meta":{"footnotes":""},"class_list":["post-354","page","type-page","status-publish","hentry"],"_links":{"self":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/pages\/354","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/comments?post=354"}],"version-history":[{"count":0,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/pages\/354\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/pages\/152"}],"wp:attachment":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/media?parent=354"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}