{"id":357,"date":"2009-12-03T02:50:36","date_gmt":"2009-12-03T02:50:36","guid":{"rendered":"http:\/\/sbullock.net\/?page_id=357"},"modified":"2020-05-10T14:18:53","modified_gmt":"2020-05-10T13:18:53","slug":"astrology","status":"publish","type":"page","link":"https:\/\/sandra-bullock.net\/sandra\/astrology\/","title":{"rendered":"Astrology"},"content":{"rendered":"<p><strong>Leo &#8211; July 23 &#8211; August 22: the lion<\/strong><br \/>\n<b>Keyword: &#8220;I Will&#8221;<\/b><\/p>\n<p>Leo is the Fifth sign of the Zodiac. Its name may derive from the Latin leo or the Greek leon, both of which mean &#8220;lion.&#8221; However, the name is likely Semitic in origin&#8230;from the Hebrew word, labi. Leo is known as the &#8220;royal sign,&#8221; symbolic of exuberance and leadership, and individuals who fall within its jurisdiction place courage and personal honesty above all else. Others may not necessarily fulfill the expectations of a Leo native and thus, the life of a Leo is often rife with disappointments. There is a radiant warmth associated with this Zodiac Sign which emanates from the Leo personality to touch the hearts of friends and admirers. This fortunate personality trait is apt to open many doors in life and the individual ruled by Leo welcomes both authority and responsibility. The fiery temperament of a Leo subject is typical of the Zodiac&#8217;s fire group&#8230;fire being the element which rules this sign. There are few people who fail to be attracted to the Leos of this world since they are indeed likeable individuals, being frank, open, honest and endearing. Of all the Zodiac Signs, it is Leo which is most known for dedication to an ideal. There is a tendency here toward a drowning in egocentricity and materialism, coupled with a lack of both the desire and the capacity for spiritual development. Thus, those born under the Sign of Leo should strive to avoid the type of exaggeration that can debase their many inherent gifts.<\/p>\n<p>Also known as the Sign of the King or President, Leo is Positive in polarity (as are Aries, Gemini, Libra, Sagittarius and Aquarius). The general characteristics of Positive Signs broadly match those for the extrovert personality and such individuals are naturally more impulsive, buoyant, communicative and sociable than are the Zodiac Signs of Negative polarity (Taurus, Cancer, Virgo, Scorpio, Capricorn and Pisces). However, Positive Signs rarely display the same levels of sensitivity or the same depth of understanding of emotional subtleties as do their Negative counterparts. Positive Signs tend to crave excitement and thus, are inclined to direct their energies outward into the world around them. Aries is the most flagrantly extrovert of the Positive Signs (with Sagittarius a close second).<\/p>\n<p>All Zodiac Signs governed by the Elements of Fire and Air are considered to be Masculine in nature. Thus, Leo (ruled by fire) is considered Masculine (as are Aries, Gemini, Libra, Sagittarius and Aquarius). Masculine signs are traditionally conceived as being more active and less receptive than their Feminine counterparts which are ruled by the Elements of Earth and Water (the Zodiac Signs of Taurus, Cancer, Virgo, Scorpio, Capricorn and Pisces). Masculine Signs focus primarily on spirituality and activity&#8230;both in the physical sense and mental sense. Masculine Signs are said to be diurnal or day-oriented. Therefore the term &#8220;masculine&#8221; should be viewed in the same light as the Yang (or bright) Polarity of the Tao.<\/p>\n<p>Leo is the natural ruler of the Fifth House of the Zodiac, often referred to as the &#8220;House of Pleasure&#8221; and known in Vedic Astrology as the &#8220;Good Fortune.&#8221; This is the field of experience in which an individual is challenged to develop creativity and self-esteem&#8230;and to find joy in living. Essentially, it deals with fun, games, gambling, playing, acting, drama, hobbies, the theater and the use or misuse of creative energies. The side of an individual which is reserved for play&#8230;the side which only emerges when there is fun to be had and the work is done&#8230;resides in the Fifth House. By its very nature, this House reflects the charming and delightful side of an individual&#8230;where hobbies, interests and playmates may be found. In short, if something provides a person with joy, then it will be preserved in the Fifth House. By tradition, this House is associated with children, enthusiasm, creativity and motivation, as well as love affairs&#8230;both legal and illicit. The influence of the Fifth House creates a sense of excitement and the craving of pleasure. It also allows an individual to see a little of himself or herself in what has been personally created&#8230;anything from the smile of a son or daughter to a piece of artwork. The Fifth House is governed by the Planet Sun&#8230;not truly a &#8220;planet&#8221; since it is a star, but classified as such for the purposes of continuity in the science of astrology.<\/p>\n<p>The opposite sign to Leo is Aquarius. From Aquarius, Leo can learn to share in a caring manner and occasionally leave &#8220;center stage&#8221; to others. Thus, can Leo natives learn to stand alone and value themselves.<\/p>\n<p><b>Positive Traits:<\/b> generous, honest, warm-hearted, magnanimous, broad-minded, expansive, loving, proud, enthusiastic and creative with a flair for showmanship and drama<\/p>\n<p><b>Negative Traits:<\/b> pompous, patronising, bossy, interferring, dogmatic, intolerant, bullying, conceited, snobbish and power-mad<\/p>\n<p><b>Likes:<\/b> speculative ventures, lavish living, rich food, children, drama, pageantry and grandeur<\/p>\n<p><b>Dislikes:<\/b> doing anything safely, day-to-day living, small-minded people, penny-pinching and mean spiritedness<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Leo &#8211; July 23 &#8211; August 22: the lion Keyword: &#8220;I Will&#8221; Leo is the Fifth sign of the Zodiac. Its name may derive from the Latin leo or the Greek leon, both of which mean &#8220;lion.&#8221; However, the name is likely Semitic in origin&#8230;from the Hebrew word, labi. Leo is known as the &#8220;royal &hellip; <a href=\"https:\/\/sandra-bullock.net\/sandra\/astrology\/\" class=\"more-link\">Continue reading<\/a><\/p>\n","protected":false},"author":13,"featured_media":0,"parent":152,"menu_order":0,"comment_status":"closed","ping_status":"open","template":"","meta":{"footnotes":""},"class_list":["post-357","page","type-page","status-publish","hentry"],"_links":{"self":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/pages\/357","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/comments?post=357"}],"version-history":[{"count":0,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/pages\/357\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/pages\/152"}],"wp:attachment":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/media?parent=357"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}