{"id":1074,"date":"2013-06-27T12:49:33","date_gmt":"2013-06-27T12:49:33","guid":{"rendered":"http:\/\/sbullock.net\/?p=1074"},"modified":"2013-06-27T12:49:33","modified_gmt":"2013-06-27T12:49:33","slug":"the-heat-gleefully-plays-with-the-buddy-cop-genre","status":"publish","type":"post","link":"https:\/\/sandra-bullock.net\/2013\/06\/27\/the-heat-gleefully-plays-with-the-buddy-cop-genre\/","title":{"rendered":"&#8216;The Heat&#8217; gleefully plays with the buddy cop genre"},"content":{"rendered":"<p><center><img decoding=\"async\" src=\"https:\/\/sandra-bullock.net\/photos\/albums\/uploads\/photoshoots\/sessions\/set_049\/thumb_mq_001.jpg\" alt=\"\" \/> <img decoding=\"async\" src=\"https:\/\/sandra-bullock.net\/photos\/albums\/uploads\/photoshoots\/sessions\/set_049\/thumb_mq_002.jpg\" alt=\"\" \/> <img decoding=\"async\" src=\"https:\/\/sandra-bullock.net\/photos\/albums\/uploads\/photoshoots\/sessions\/set_049\/thumb_mq_007.jpg\" alt=\"\" \/> <img decoding=\"async\" src=\"https:\/\/sandra-bullock.net\/photos\/albums\/uploads\/photoshoots\/sessions\/set_049\/thumb_mq_004.jpg\" alt=\"\" \/><\/center><\/p>\n<div class=\"link\">Photoshoot Sections > Sessions > <a href=\"https:\/\/sandra-bullock.net\/photos\/thumbnails.php?album=582\">#049<\/a><\/div>\n<p>&#8220;The Heat&#8221; has all the elements you&#8217;d expect from a buddy cop movie — the oil-and-water partnership, the car chases, the wisecracks — and a few you wouldn&#8217;t — for instance, a scene involving Spanx.<\/p>\n<p>Faithfully conforming to the macho genre made famous by movies such as &#8220;Bad Boys&#8221; and &#8220;Lethal Weapon,&#8221; &#8220;The Heat&#8221; is also — curiously — summer&#8217;s only studio film built around female leads: Sandra Bullock and Melissa McCarthy.<\/p>\n<p>&#8220;If someone asks what you wanna do and you don&#8217;t really wanna work, you pick the most farfetched thing,&#8221; Bullock said. &#8220;This was it, a pairing where everyone was equal and you had these storylines that weren&#8217;t girly&#8230;. It had depth and humor and balls and action. It was just something I saw the boys getting to do.&#8221;<\/p>\n<p><!--more--><\/p>\n<p>Directed by Paul Feig (&#8220;Bridesmaids&#8221;) from a script by &#8220;Parks and Recreation&#8221; writer Katie Dippold, &#8220;The Heat&#8221; pairs Bullock as Sarah Ashburn, an uptight FBI agent in ill-fitting suits, with McCarthy as Shannon Mullins, a brusque Boston cop who dresses like a 1980s lady rapper. Instead of romantic pining, the story&#8217;s emotional undercurrent comes from the loneliness of women who are very good at their jobs.<\/p>\n<p>&#8220;It wasn&#8217;t a movie written for two guys,&#8221; Feig said. &#8220;It was funny in a way women are funny and touched on themes of female friendship, professional women in the workplace who have chosen career over family and kids.&#8221;<\/p>\n<p>On-screen, Bullock and McCarthy play goofy but capable everywomen, and in a joint interview, they slipped easily into their public personae, sharing photos of their young children, bickering about texts — &#8220;You don&#8217;t answer, that&#8217;s just a fact,&#8221; Bullock said. &#8220;I&#8217;m better at texting than anything else I do,&#8221; McCarthy responded — and assessing how much teasing a reporter could withstand. &#8220;I bet we could push you pretty far,&#8221; Bullock said, with a twinkle.<\/p>\n<p>Were it not for the presence of enough publicists behind the hotel room door to launch a presidential campaign, it would be easy to forget that these are two of the most powerful women in Hollywood, with the ability to get movies greenlighted and to approve their directors and costars. Once they attached themselves to &#8220;The Heat,&#8221; the project went from script to shooting in a matter of weeks — an accelerated progression in a town where even favored scripts linger in development for years.<\/p>\n<p>That both women are older than 40 — a demographic Hollywood typically ignores — and that McCarthy&#8217;s body doesn&#8217;t conform to Size 0 industry norms makes their shared success that much more unusual.<\/p>\n<p>Bullock, 48, and McCarthy, 42, have both risen on that ineffable quality that creates movie stars and sometimes presidents — they seem like they&#8217;d be fun to get a beer with. Bullock, the Virginia-born daughter of a Pentagon contractor and an opera singer, came up in the &#8217;90s, propelled by a tomboyish charm in movies such as &#8220;Speed&#8221; and &#8220;Miss Congeniality&#8221; before winning an Oscar for playing the brassy Southern mother in 2009&#8217;s &#8220;The Blind Side.&#8221;<\/p>\n<p>McCarthy, raised on a farm in Illinois, performed in the L.A.-based improv comedy group the Goundlings and has appeared on TV shows such as &#8220;Gilmore Girls&#8221; and her current program &#8220;Mike &#038; Molly&#8221; but is a more recently minted star on the big screen. She emerged in a breakout role as a rambunctious and occasionally lewd member of a wedding party in 2011&#8217;s &#8220;Bridesmaids&#8221; and solidified her status this year as a star who can open a movie by playing a crook who plagues Jason Bateman&#8217;s character in the surprise hit &#8220;Identity Thief.&#8221;<\/p>\n<p>For Bullock, the increasingly prominent role of women in big-screen comedies is a heartening change from when she emerged in Hollywood 20 years ago. Much of that change she attributes to the rise of writer-performers such as Dippold and McCarthy, who is shooting and starring in a comedy for Warner Bros called &#8220;Tammy,&#8221; which she co-wrote with her husband, actor Ben Falcone.<\/p>\n<p>&#8220;It does still feel Wild Westish. Carol Burnett was doing all her writing. You had those iconic women who did it, but they were the exception,&#8221; Bullock said. &#8220;I hope one day we don&#8217;t say &#8216;Women in comedy,&#8217; &#8216;Men and comedy,&#8217; they just go &#8216;Who was in it?'&#8221;<\/p>\n<p>Chemistry factor<\/p>\n<p>The actresses had never met until Bullock called McCarthy in her trailer on the &#8220;Identity Thief&#8221; set to see whether she was interested in playing Mullins. As in any screen pairing, chemistry would be critical — &#8220;The Heat&#8221; calls for their characters to evolve from elbow-flinging rivals to glass-clinking buddies over less than two hours.<\/p>\n<p>&#8220;You have to instantly bond, instantly create a relationship in this weird world that we&#8217;re in,&#8221; Bullock said.<\/p>\n<p>&#8220;She was game for anything,&#8221; McCarthy said. &#8220;It was fun to poke and jab at her.&#8221;<\/p>\n<p>&#8220;We had a safe word,&#8221; Bullock said: &#8220;Peaches.&#8221;<\/p>\n<p>In person, Bullock was the alpha female, McCarthy more reserved — in stark contrast to the naughty, all-id characters she often plays.<\/p>\n<p>One thing both women share is a willingness to wield their bodies on-screen in unflattering ways: In &#8220;The Heat,&#8221; Bullock is all angles — elbows and knees and pin-straight hair, and McCarthy is a lady linebacker, barreling after criminals in MC Hammer pants.<\/p>\n<p>&#8220;It&#8217;s those weird quirks to me that make someone who they are,&#8221; McCarthy said. &#8220;A lot of times, especially for women, all of the tools are taken away. You have to look perfect, act perfect, you&#8217;re perfectly poised, you&#8217;re always appropriate. I don&#8217;t know anyone who&#8217;s like that, but also you&#8217;ve taken away all the tools to be funny or to be odd.&#8221;<\/p>\n<p>In one scene, Ashburn and Mullins drunkenly dance in a bar — Feig provided a choreographer on the set, but the actresses dismissed the idea, fearing the dance would not be sufficiently awful.<\/p>\n<p>&#8220;We have to be the butt of the joke,&#8221; McCarthy said. &#8220;If you&#8217;re outside commenting or winking &#8230; no, you&#8217;re the ass. You are the joke. You have to take the hit. The more you can take the hit, the funnier it is for people watching … just out of sheer relief that, &#8216;I&#8217;m not the one who ripped her pants.'&#8221;<\/p>\n<p>The bar dance scene in &#8220;The Heat&#8221; was inspired by moments in screenwriter Dippold&#8217;s own 20s and by a montage in the 1986 buddy cop comedy &#8220;Running Scared&#8221; when actors Billy Crystal and Gregory Hines were living it up in Key West and the camera kept cutting to them on scooters with a different woman on the back. Dippold wondered, was there a screen version of that kind of fun for women?<\/p>\n<p>&#8220;Growing up in high school, it felt like the guys dictated where the party was,&#8221; said Dippold, 33, who performed with the New York-based improv comedy group Upright Citizens Brigade before moving to L.A. for a writing job on the sketch comedy show &#8220;MADtv.&#8221; &#8220;Girls would be like, &#8216;This is where all the guys are. What a fun thing!&#8217; But I like when I&#8217;m out with female friends and it&#8217;s just a crazy time.&#8221;<\/p>\n<p>When it comes to the box office, &#8220;The Heat&#8221; is in heavy male company, coming out in the hyper-masculine season of movies such as &#8220;Man of Steel&#8221; and &#8220;The Lone Ranger.&#8221; The film was originally scheduled to be released in the spring, but 20th Century Fox shifted it to June 28, in part because the summer had little to offer women but also because &#8220;The Heat&#8221; tested so well, according to Feig.<\/p>\n<p>&#8220;We were completely four-quad,&#8221; Feig said, referring to the four demographic groups as measured by movie studios — men and women over and under age 25. &#8220;I made sure we didn&#8217;t tilt too much either way. The lady jokes I like are like the Spanx. It&#8217;s relatable to women, and yet guys can find it kind of funny.&#8221;<\/p>\n<p><a href=\"http:\/\/www.latimes.com\/entertainment\/movies\/moviesnow\/la-et-mn-the-heat-melissa-mccarthy-sandra-bullock-paul-feig-20130623,0,5113178.story\" target=\"_blank\">LA Times<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Photoshoot Sections > Sessions > #049 &#8220;The Heat&#8221; has all the elements you&#8217;d expect from a buddy cop movie — the oil-and-water partnership, the car chases, the wisecracks — and a few you wouldn&#8217;t — for instance, a scene involving Spanx. Faithfully conforming to the macho genre made famous by movies such as &#8220;Bad Boys&#8221; &hellip; <a href=\"https:\/\/sandra-bullock.net\/2013\/06\/27\/the-heat-gleefully-plays-with-the-buddy-cop-genre\/\" class=\"more-link\">Continue reading<\/a><\/p>\n","protected":false},"author":13,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[13,4,50],"tags":[],"class_list":["post-1074","post","type-post","status-publish","format-standard","hentry","category-articles-reviews","category-gallery","category-the-heat"],"_links":{"self":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/posts\/1074","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/comments?post=1074"}],"version-history":[{"count":0,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/posts\/1074\/revisions"}],"wp:attachment":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/media?parent=1074"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/categories?post=1074"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/tags?post=1074"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}