{"id":1854,"date":"2015-11-11T14:07:09","date_gmt":"2015-11-11T16:07:09","guid":{"rendered":"http:\/\/sandra-bullock.net\/?p=1854"},"modified":"2015-11-11T14:07:09","modified_gmt":"2015-11-11T16:07:09","slug":"sandra-bullock-on-hollywood-sexism-pay-disparity-and-the-worst-experience-of-her-career","status":"publish","type":"post","link":"https:\/\/sandra-bullock.net\/2015\/11\/11\/sandra-bullock-on-hollywood-sexism-pay-disparity-and-the-worst-experience-of-her-career\/","title":{"rendered":"Sandra Bullock on Hollywood Sexism, Pay Disparity and ‘The Worst Experience’ of Her Career"},"content":{"rendered":"<p>As part of this week’s <a href=\"http:\/\/variety.com\/2015\/film\/news\/hollywood-gender-pay-gap-inequality-1201636553\/\" target=\"_blank\">Variety cover story<\/a> on income disparity for women in Hollywood, Sandra Bullock spoke about the first time she became aware that she was being treated differently at work because of her gender. As Bullock recalled, it was on the set of a movie she made 10 years ago, which she didn’t name. :”It was the worst experience I ever had,” Bullock said. Read her full story below.<\/p>\n<blockquote><p>Sandra Bullock: It’s a bigger issue than money. I know we’re focused on the money part right now. That’s just a byproduct. I keep saying, “Why is it that no one is standing up and saying you can’t say that about a woman?” We’re mocked and judged in the media and articles. Really, how men are described in articles versus women, there’s a big difference. I always make a joke: “Watch, we’re going to walk down the red carpet, I’m going to be asked about my dress and my hair while the man standing next to me will be asked about his performance and political issues.” Once we start shifting how we perceive women and stop thinking about them as “less than,” the pay disparity will take care of itself. There’s a much bigger issue at hand. I’m glad Hollywood got caught.<\/p>\n<p>But Hollywood has always been at the forefront of pioneering a new road and a new movement. So it’s a blessing that they got caught, and there are a lot of outspoken, narcissistic actors like myself who are very happy to talk about the issue and keep it alive.<\/p>\n<p>My mother basically raised me as, “Women can do everything men can do. Don’t get married. Blaze your own trail.” And I didn’t think others thought any differently. I always thought we are all equal, and we are. I was actually doing a film about 10 years ago, and I found myself yelling and being angry. And I was like, “What is happening to me?” I was literally fearful. And I realized, it’s because I’m female. It dawned on me. At that day and age, at that point in my career, it was the worst experience I ever had.<\/p>\n<p>I was destroyed, because you can’t unsee something. Was I so naïve up to this point to actually think that I was on an equal level with everybody? It was the way I was being treated, because I was female, versus the way others were being treated. It took me a while. It took a year and a half, where I regrouped, and thought, “Okay, this is an isolated case.” I’ve had other subtle experiences, but nothing that blatant. It was a big eye opener, because it wasn’t just men on women. A lot if came from women as well. The blessing of that film was that it opened my eyes.<\/p>\n<p>I was just happy to be working, so you take it, especially in this business. Only like 1 or 2 percent of us get to do this job. I’m not money oriented. I lucked into money most of the time. But money is the byproduct of everything. How do you explain to your son that the ERA hasn’t passed? I want him to think I’m the boss and women are equal, but I can’t really support that in the outside world. I hope in my lifetime, for him, everything is a level-playing field. We can hope.<\/p><\/blockquote>\n","protected":false},"excerpt":{"rendered":"<p>As part of this week’s Variety cover story on income disparity for women in Hollywood, Sandra Bullock spoke about the first time she became aware that she was being treated differently at work because of her gender. As Bullock recalled, it was on the set of a movie she made 10 years ago, which she &hellip; <a href=\"https:\/\/sandra-bullock.net\/2015\/11\/11\/sandra-bullock-on-hollywood-sexism-pay-disparity-and-the-worst-experience-of-her-career\/\" class=\"more-link\">Continue reading<\/a><\/p>\n","protected":false},"author":13,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[13],"tags":[36],"class_list":["post-1854","post","type-post","status-publish","format-standard","hentry","category-articles-reviews","tag-articles"],"_links":{"self":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/posts\/1854","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/comments?post=1854"}],"version-history":[{"count":0,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/posts\/1854\/revisions"}],"wp:attachment":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/media?parent=1854"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/categories?post=1854"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/tags?post=1854"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}