{"id":2521,"date":"2022-12-27T01:44:26","date_gmt":"2022-12-27T01:44:26","guid":{"rendered":"https:\/\/sandra-bullock.net\/?p=2521"},"modified":"2022-12-27T01:44:26","modified_gmt":"2022-12-27T01:44:26","slug":"jennifer-coolidge-waitressed-with-sandra-bullock-in-the-80s-sandra-really-had-her-act-together","status":"publish","type":"post","link":"https:\/\/sandra-bullock.net\/2022\/12\/27\/jennifer-coolidge-waitressed-with-sandra-bullock-in-the-80s-sandra-really-had-her-act-together\/","title":{"rendered":"Jennifer Coolidge Waitressed With Sandra Bullock in the ’80s: ‘Sandra Really Had Her Act Together’"},"content":{"rendered":"<p><center><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/-eaCklx4kJo\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><\/center><\/p>\n<p>Before The White Lotus star Jennifer Coolidge scored her first significant role, she was a cocktail waitress in the same restaurant where Sandra Bullock was a hostess.<\/p>\n<p>Coolidge reflected on their time together in that industry, sharing how Bullock nabbed her prime waitressing shifts and how she knew the Miss Congeniality star was going “so f***ing far” in Hollywood.<\/p>\n<p><strong>Jennifer Coolidge is a ‘great example’ of beating the odds<\/strong><\/p>\n<p>While speaking to Ariana Grande for Entertainment Weekly, Coolidge reflected on having a career upswing in recent years. “… What I want to say is that it’s so hard to go through life and have hope when your life has been going a certain way that you don’t really approve of,” she said.<\/p>\n<p>“I think of these jobs that you just can’t make it through the day and stuff, and I feel like this unexpected moment that happened to me can happen to anybody,” she went on. “Where you’re going along in the car, and you’ve been going the same speed all these years, and then all of a sudden this cool thing happens.”<\/p>\n<p>“I think I’m a great example of ‘What are the odds?’ And this can happen to anybody,” she offered.<\/p>\n<p><strong>Jennifer Coolidge said Sandra Bullock was the reason she eventually left a job she ‘couldn’t get fired’ from <\/strong><\/p>\n<p>Coolidge spoke about working in a restaurant as a cocktail waitress before she found success in acting, revealing she once had a job she “couldn’t get fired” from. Even though she regularly bailed on her shifts to party, management didn’t terminate her.<\/p>\n<p>Notably, Bullock also worked there as a hostess. “Sandra really had her act together,” Coolidge said on Jimmy Kimmel Live before noting she was vastly different and “partying a lot in those days.”<\/p>\n<p>She told Conan O’Brien that Bullock eventually got her weekend cocktail waitressing shifts because she “stopped really showing up” for part of them. She was forced to quit the job, but she wasn’t holding it against Bullock. “I was so mad Sandra got the shifts,” she recalled. “But I wasn’t showing up.”<\/p>\n<p><strong>Jennifer Coolidge predicted Sandra Bullock would make it in showbusiness<\/strong><\/p>\n<p>Coolidge recalled feeling that Bullock was going places back then. She thought, “She’s going so f***ing far,” and noted she was also “incredibly nice” (per IndieWire).<\/p>\n<p>The American Pie star said Bullock “had a much better idea of the business” than her. “She was much more savvier,” Coolidge explained. “She was running the show at 30.” <\/p>\n<p>Bullock “got out early and had it figured it out,” according to her former co-worker, who added, “She really thought she could have her own thing.”<\/p>\n<p>Unlike The Lost City star, Coolidge didn’t realize that to succeed in Hollywood, “you have to know the business.” <\/p>\n<p>“I never really asked those questions. It never occurred to me to get my own thing going,” she shared. “I was waiting for people to give me my opportunities rather than create them.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Before The White Lotus star Jennifer Coolidge scored her first significant role, she was a cocktail waitress in the same restaurant where Sandra Bullock was a hostess. Coolidge reflected on their time together in that industry, sharing how Bullock nabbed her prime waitressing shifts and how she knew the Miss Congeniality star was going “so &hellip; <a href=\"https:\/\/sandra-bullock.net\/2022\/12\/27\/jennifer-coolidge-waitressed-with-sandra-bullock-in-the-80s-sandra-really-had-her-act-together\/\" class=\"more-link\">Continue reading<\/a><\/p>\n","protected":false},"author":14,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[9],"tags":[],"class_list":["post-2521","post","type-post","status-publish","format-standard","hentry","category-press"],"_links":{"self":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/posts\/2521","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/users\/14"}],"replies":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/comments?post=2521"}],"version-history":[{"count":1,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/posts\/2521\/revisions"}],"predecessor-version":[{"id":2522,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/posts\/2521\/revisions\/2522"}],"wp:attachment":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/media?parent=2521"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/categories?post=2521"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/tags?post=2521"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}