{"id":2546,"date":"2023-08-15T01:33:44","date_gmt":"2023-08-15T00:33:44","guid":{"rendered":"https:\/\/sandra-bullock.net\/?p=2546"},"modified":"2023-08-15T01:33:44","modified_gmt":"2023-08-15T00:33:44","slug":"sandra-bullock-true-story-takes-heartbreaking-real-world-turn","status":"publish","type":"post","link":"https:\/\/sandra-bullock.net\/2023\/08\/15\/sandra-bullock-true-story-takes-heartbreaking-real-world-turn\/","title":{"rendered":"Sandra Bullock True Story Takes Heartbreaking Real World Turn"},"content":{"rendered":"<p>The 2009 film The Blind Side, starring Sandra Bullock, about now-retired NFL lineman Michael Oher, was a seemingly feel-good based on a true story account of Oher’s burgeoning football career and his adoption by the affluent Tuohy family. However, it turns out that there is a darker side to this story.<\/p>\n<p>Oher has filed a suit against Sean and Leigh Anne Tuohy, played by Tim McGraw and Sandra Bullock, that alleges that not only did they trick him into signing a conservatorship rather than adopting him, but they used that power to make financial deals and earn money off his name. Oher reportedly learned of the conservatorship in February (via ESPN).<\/p>\n<p>The Blind Side also depicted Sean and Leigh Anne Tuohy in the film, with Sandra Bullock earning an Oscar for playing the latter. The film earned more than $300 million at the box office and was also nominated for a Best Picture Oscar. Michael Oher’s petition also states that Sean and Leigh Anne put together a deal that paid them and their birth children royalties for the film while Oher received nothing.<\/p>\n<p>While the Sandra Bullock roles in The Blind Side depicts the Tuohys as adopting Michael Oher, Oher has since stated that he signed conservatorship papers as a rising high school athlete, which the Tuohys allegedly indicated was no different than adoption papers.<\/p>\n<p>However, there is quite a large legal distinction between the two, as adoption papers would have made Oher a legal member of the Tuohy family and would have allowed him power over his own financial affairs. Under a conservatorship, that financial authority would be given to the Tuohys despite the fact that Oher displayed no physical or mental disabilities to be unable to handle his own affairs. This wasn’t the case with the way Sandra Bullock and company played things in the flick.<\/p>\n<p>Since The Blind Side was released, Michael Oher has since voiced his discontent with how he was portrayed in the movie, though was previously okay with letting the inspirational method outweigh the film’s effects on his own life.<\/p>\n<p>As Oher has indicated in the past, he didn’t like how he was portrayed as unintelligent in the film and that his portrayal would ultimately affect how some decision-makers in the NFL viewed him.<\/p>\n<p>After learning about his lack of royalties (Sandra Bullock was reportedly paid $5 million) for the film based on his life story and the fact that he was under a conservatorship and not actually adopted, his relationship with the Tuohys was “permanently fractured,” according to his attorney.<\/p>\n<blockquote><p>After learning about his lack of royalties for the film based on his (Michael Oher’s) life story and the fact that he was under a conservatorship and not actually adopted, his relationship with the Tuohys was “permanently fractured,”\n<\/p><\/blockquote>\n<p>The suit filed by Michael Oher and his attorney seeks to have the court end the Tuohy’s conservatorship and issue an injunction that bars them from using his name and likeness in the future.<\/p>\n<p>Additionally, the suit seeks to get a full accounting of the profits the family has made from The Blind Side and any other monies that have been made using his story. The suit seeks to get Michael Oher his fair of the profits alongside compensatory and punitive damages. This would obviously give the Sandra Bullock movie a significantly different feeling on a rewatch.<\/p>\n<p>At this time, the Tuohy family had not returned phone calls made to them by ESPN (and presumably other publications). The family’s attorney also declined to comment and stated that the family would be filing a legal response to the allegations in the coming weeks. We’ll keep you updated as Michael Oher’s suit progresses in the legal system.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The 2009 film The Blind Side, starring Sandra Bullock, about now-retired NFL lineman Michael Oher, was a seemingly feel-good based on a true story account of Oher’s burgeoning football career and his adoption by the affluent Tuohy family. However, it turns out that there is a darker side to this story. Oher has filed a &hellip; <a href=\"https:\/\/sandra-bullock.net\/2023\/08\/15\/sandra-bullock-true-story-takes-heartbreaking-real-world-turn\/\" class=\"more-link\">Continue reading<\/a><\/p>\n","protected":false},"author":14,"featured_media":2547,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[13,105,39,47,5,15],"tags":[],"class_list":["post-2546","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-articles-reviews","category-career","category-films","category-media-alert","category-personal","category-the-blind-side"],"_links":{"self":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/posts\/2546","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/users\/14"}],"replies":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/comments?post=2546"}],"version-history":[{"count":1,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/posts\/2546\/revisions"}],"predecessor-version":[{"id":2548,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/posts\/2546\/revisions\/2548"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/media\/2547"}],"wp:attachment":[{"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/media?parent=2546"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/categories?post=2546"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/sandra-bullock.net\/wp-json\/wp\/v2\/tags?post=2546"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}